scrapy/command-tools.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-05 四 17:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>scrapy 命令行工具</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">scrapy 命令行工具</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org927aa2f">1. 概述</a></li>
<li><a href="#org17f43b3">2. 实践</a>
<ul>
<li><a href="#org1de761a">2.1. startproject</a></li>
<li><a href="#org808887a">2.2. genspider</a></li>
<li><a href="#org5c38bec">2.3. crawl</a></li>
<li><a href="#orgffad4eb">2.4. list</a></li>
<li><a href="#org27c291a">2.5. view</a></li>
<li><a href="#org1dece4b">2.6. shell</a></li>
<li><a href="#org06d46bf">2.7. parse</a></li>
<li><a href="#org9d2a166">2.8. runspider</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org927aa2f" class="outline-2">
<h2 id="org927aa2f"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
scrapy 提供很多命令<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>可以方便的建立爬虫项目、改变项目设置、调试爬虫等。
</p>
<div class="org-src-container">
<pre class="src src-sh">scrapy --help
</pre>
</div>

<p>
有些命令是只能在爬虫项目内部执行的，比如 crawl，list 等。
</p>
</div>
</div>

<div id="outline-container-org17f43b3" class="outline-2">
<h2 id="org17f43b3"><span class="section-number-2">2</span> 实践</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1de761a" class="outline-3">
<h3 id="org1de761a"><span class="section-number-3">2.1</span> startproject</h3>
<div class="outline-text-3" id="text-2-1">
<pre class="example">
   Syntax: scrapy startproject &lt;project_name&gt; [project_dir]
   Requires project: no
</pre>
<p>
在 project_dir 目录下创建名为 project_name 的新 Scrapy 项目。如果未指定 project_dir，则 project_dir 将与 project_name 相同。
</p>
</div>
</div>

<div id="outline-container-org808887a" class="outline-3">
<h3 id="org808887a"><span class="section-number-3">2.2</span> genspider</h3>
<div class="outline-text-3" id="text-2-2">
<pre class="example">
   Syntax: scrapy genspider [-t template] &lt;name&gt; &lt;domain&gt;
   Requires project: no
</pre>
<p>
在当前文件夹中创建新爬虫，如果从项目内部调用，则当前项目的 spiders 文件夹中创建。&lt;name&gt; 参数设置为爬虫的名称，而 &lt;domain&gt; 用于生成爬虫的 allowed_domains 和 start_urls 属性。
</p>
</div>
</div>

<div id="outline-container-org5c38bec" class="outline-3">
<h3 id="org5c38bec"><span class="section-number-3">2.3</span> crawl</h3>
<div class="outline-text-3" id="text-2-3">
<pre class="example">
   Syntax: scrapy crawl &lt;spider&gt;
   Requires project: yes
</pre>

<p>
运行爬虫。
</p>
</div>
</div>

<div id="outline-container-orgffad4eb" class="outline-3">
<h3 id="orgffad4eb"><span class="section-number-3">2.4</span> list</h3>
<div class="outline-text-3" id="text-2-4">
<pre class="example">
Syntax: scrapy list
Requires project: yes
</pre>

<p>
列出当前项目中的所有可用爬虫。
</p>
</div>
</div>

<div id="outline-container-org27c291a" class="outline-3">
<h3 id="org27c291a"><span class="section-number-3">2.5</span> view</h3>
<div class="outline-text-3" id="text-2-5">
<pre class="example">
   Syntax: scrapy view &lt;url&gt;
   Requires project: no
</pre>

<p>
在浏览器中打开给定的 URL，内容正如 Scrapy spiders 所见。有时爬虫会看到不同于普通用户的页面，因此可以用来检查爬虫“看到”的内容并确认它是所期望的。
</p>
</div>
</div>

<div id="outline-container-org1dece4b" class="outline-3">
<h3 id="org1dece4b"><span class="section-number-3">2.6</span> shell</h3>
<div class="outline-text-3" id="text-2-6">
<pre class="example">
Syntax: scrapy shell [url]
Requires project: no
</pre>

<p>
启动 Scrapy shell，如果给定 URL，会返回请求结果。还支持 UNIX 样式的本地文件路径，包括相对或绝对路径。有关详细信息，请参阅 <a href="https://docs.scrapy.org/en/latest/topics/shell.html#topics-shell">Scrapy shell</a>。
</p>
</div>
</div>

<div id="outline-container-org06d46bf" class="outline-3">
<h3 id="org06d46bf"><span class="section-number-3">2.7</span> parse</h3>
<div class="outline-text-3" id="text-2-7">
<pre class="example">
Syntax: scrapy parse &lt;url&gt; [options]
Requires project: yes
</pre>

<p>
获取给定 URL 并使用处理它的爬虫解析它，如果没有 parse 方法，使用 <code>--callback</code> 选项传递的方法。
</p>
</div>
</div>

<div id="outline-container-org9d2a166" class="outline-3">
<h3 id="org9d2a166"><span class="section-number-3">2.8</span> runspider</h3>
<div class="outline-text-3" id="text-2-8">
<pre class="example">
Syntax: scrapy runspider &lt;spider_file.py&gt;
Requires project: no
</pre>

<p>
无需创建项目，直接运行 Python 文件中的爬虫。
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://docs.scrapy.org/en/latest/topics/commands.html#">scrapy command line</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-03-05 四 17:02</p>
<p class="validation"></p>
</div>
</body>
</html>
